[{"url":"https:\/\/play.google.com\/store\/apps\/developer?id=Facebook","title":"Facebook - Android Apps on Google Play","company":null,"score":null,"last_update":null,"downloads":null,"version":null,"comments":[],"ratings":[],"saved_to_db":false},{"url":"https:\/\/play.google.com\/store\/apps\/details?id=com.facebook.orca","title":"Messenger â\u0080\u0093 Text and Video Chat for Free - Android Apps on Google Play","company":"Facebook","score":"4.0","last_update":"September 13, 2017","downloads":"1,000,000,000 - 5,000,000,000","version":"Varies with device","comments":[{"author":"Gion Karl Valencia","date":"September 16, 2017","score":"","text":"Its Got Better Good Thing It's Not Lagging Anymore On My Phone. But It's Still Not Installing On My Tablet.   Full Review"},{"author":"m. k","date":"September 17, 2017","score":"","text":"not my day in add...anyone..   Full Review"},{"author":"M H Khan Hassan","date":"September 15, 2017","score":"","text":"taken long time to start.   Full Review"},{"author":"Michael Mailey","date":"September 17, 2017","score":"","text":"Great   Full Review"},{"author":"","date":"September 15, 2017","score":"","text":"I really love this app! It makes communication to others simple, easy, secure and fast. One more thing hehe, can I request? (My friends and I decided to suggest it) On the next other updates of this app, can you pls add an icon or wtvr you call it, that can change our (profile) pic on fb(messenger only) anytime that will not make any announcements or anything that other will gonna know (unlike when we're changing profile pics in facebook app.) Hehe hope you can add thisð\u009f\u0098\u008að\u009f\u0099\u008f   Full Review"}],"ratings":{"nb5":"27,588,848","nb4":"7,199,246","nb3":"4,655,459","nb2":"2,088,329","nb1":"6,553,777"},"saved_to_db":true},{"url":"https:\/\/play.google.com\/store\/apps\/developer?id=Snap+Inc","title":"Snap Inc - Android Apps on Google Play","company":null,"score":null,"last_update":null,"downloads":null,"version":null,"comments":[],"ratings":[],"saved_to_db":false},{"url":"https:\/\/play.google.com\/store\/apps\/details?id=com.snapchat.android","title":"Snapchat - Android Apps on Google Play","company":"Snap Inc","score":"4.1","last_update":"September 15, 2017","downloads":"500,000,000 - 1,000,000,000","version":"Varies with device","comments":[{"author":"animeloverjulia","date":"September 17, 2017","score":"","text":"SNAPCHAT is AWESOME cool filters , cool stories and pretty much everything is awesome I will recommend this app to everybody. However snapchat is more better in IOS than android I have an android phone so I know what its like. the camera is worst, it sometimes be slow but not very slow. Also can you please tell me why my map isn't working I update it when an update comes up but still no map please fix that. But either than that I LOVE IT.   Full Review"},{"author":"Jaylon Chung","date":"September 15, 2017","score":"","text":"Not much I can say since everyone else has already taken the words out of my mouth. Poor optimisation, poor compatibilty, buggy, laggy, highly compressed images and videos. Snapchat on Android is absolutely garbage than IOS. It seems as though IOS is always one step ahead of android. So please, Snapchat developers, focus on both rather than one more than the other   Full Review"},{"author":"","date":"September 17, 2017","score":"","text":"It never loads constantly saying could not refresh or check your internet connection but yet everything else works on my phone so it's snapchat itself. Very slow and constantly freezing and then the whole phone freezes but only when I use snapchat so please fix as I can already see so many bad reviews they will probably uninstall if they already haven't   Full Review"},{"author":"Andrea Phillips","date":"September 17, 2017","score":"","text":"Why is the camera quality so bad? My camera normaly is clear and stunning. But on snapchat its slow pixilated and fuzzy! Get it together and fix it! Who wants fuzzy slefies? And laggy videos?? Also when are you going to add an update like the iphones!! It is NOT fair to favor other customers! Very dissapointing :\/   Full Review"},{"author":"Jelle","date":"September 17, 2017","score":"","text":"Android gets left behind when it comes to updates and features. I wanted to use the feature that allows you to keep recording for 60 seconds, but it's not here even though Apple users have had this for a few weeks. This happened with filters too, or any big feature for that matter   Full Review"}],"ratings":{"nb5":"8,336,131","nb4":"1,772,918","nb3":"1,179,508","nb2":"611,135","nb1":"1,671,783"},"saved_to_db":true},{"url":"https:\/\/play.google.com\/store\/apps\/developer?id=Instagram","title":"Instagram - Android Apps on Google Play","company":null,"score":null,"last_update":null,"downloads":null,"version":null,"comments":[],"ratings":[],"saved_to_db":false},{"url":"https:\/\/play.google.com\/store\/apps\/details?id=com.instagram.android","title":"Instagram - Android Apps on Google Play","company":"Instagram","score":"4.5","last_update":"September 18, 2017","downloads":"1,000,000,000 - 5,000,000,000","version":"Varies with device","comments":[{"author":"Dave A","date":"September 18, 2017","score":"","text":"I really like this app but have a privacy issue when it comes to sharing to Facebook. My Facebook privacy settings are set to sharing to friends except acquaintances. However, when I share anything from Instagram it is able to be viewed by everyone, it appears, well at least to the acquaintances which I do not want. I do not seem to have have a choice in the matter either, when sharing from Instagram. Can something be done about this please. I am reluctant to now share fully, as I would like to do, to Facebook due to this matter.   Full Review"},{"author":"m.a kaleem","date":"September 17, 2017","score":"","text":"it cant read the gallery of redmi 3s plus pls i request you to fix it if u fix i will rat you 5 stars   Full Review"},{"author":"Mohd Adil","date":"September 17, 2017","score":"","text":"No vibration to normal sound   Full Review"},{"author":"","date":"September 16, 2017","score":"","text":"Ø¨Ø±Ù\u0086Ø§Ù\u0085Ù\u0087 Ø®Ù\u0088Ø¨Û\u008c Ù\u0087Ø³Øª   Full Review"},{"author":"","date":"September 16, 2017","score":"","text":"Nice app   Full Review"}],"ratings":{"nb5":"38,887,687","nb4":"9,122,216","nb3":"3,038,034","nb2":"1,029,784","nb1":"2,081,688"},"saved_to_db":true},{"url":"https:\/\/play.google.com\/store\/apps\/developer?id=Telepathic","title":"Telepathic - Android Apps on Google Play","company":null,"score":null,"last_update":null,"downloads":null,"version":null,"comments":[],"ratings":[],"saved_to_db":false},{"url":"https:\/\/play.google.com\/store\/apps\/details?id=tv.telepathic.hooked","title":"HOOKED - Chat Stories - Android Apps on Google Play","company":"Telepathic","score":"4.4","last_update":"August 20, 2017","downloads":"5,000,000 - 10,000,000","version":"1.41","comments":[{"author":"Melissa Rachels","date":"August 30, 2017","score":"","text":"Would love to be able to read a whole without stopping. Paying to read a story after you tricked me into installing it, cos it said I had to install to finish the story is just wrong. I can't afford to pay anything right now, and stopping once you get into it, so many times gets annoying and the story becomes boring.   Full Review"},{"author":"","date":"September 10, 2017","score":"","text":"Its a good app but... I wish you didn't have to pay to see images or videos. I just want to read scary chat messages with no interruptions .And why do you have to wait 45 minutes to read the next part. Can someone make a app that is scary chat messages with free everything and no interruptions, PLEASE!?!?!? I'm just sayin.   Full Review"},{"author":"Yana Massey Massey","date":"September 8, 2017","score":"","text":"When you wanna know what happens you have to wait 20 min but you gotta pay to read it all so stupid?! I think it's a little  awesome!! Its really scary I get scared at night but you really wanna know what will happen!! Pls change it so we don't have to pay I'm 10 by the way   Full Review"},{"author":"k3k","date":"August 29, 2017","score":"","text":"Right when I got in the app it asked if I wanted a one week free trial and I said yes. After that it started charging my google play account without my permission and I lost ~$10. I sent 3 emails and no responce. Good app and I like the stories, and I will change my rating if I ever get a refund.   Full Review"},{"author":"MOOSE CORP","date":"September 5, 2017","score":"","text":"I hate the fact that you have to spend money to \"hoot\" forever. Its like they want to restrict READING. And isnt reading something that you need to learn? YES, YES IT IS! And they hide the pictures so you dont know whats going on and you cant get entertained by funny pictures. They really just want to make people without money jealous of people who get to enjoy every bit of detail. AND WHO WANTS TO WAIT AN HOUR TO READ A GOOD BOOK. This is just my opinion so this may not all be true. Thanks for reading :P   Full Review"}],"ratings":{"nb5":"248,291","nb4":"42,111","nb3":"19,100","nb2":"6,726","nb1":"25,297"},"saved_to_db":true},{"url":"https:\/\/play.google.com\/store\/apps\/developer?id=Wish+Inc.","title":"Wish Inc. - Android Apps on Google Play","company":null,"score":null,"last_update":null,"downloads":null,"version":null,"comments":[],"ratings":[],"saved_to_db":false},{"url":"https:\/\/play.google.com\/store\/apps\/details?id=com.contextlogic.wish","title":"Wish - Shopping Made Fun! - Android Apps on Google Play","company":"Wish Inc.","score":"4.5","last_update":"September 8, 2017","downloads":"100,000,000 - 500,000,000","version":"4.10.5","comments":[{"author":"Benri Henrico","date":"September 18, 2017","score":"","text":"If I could give minus rating I would've. I ordered a watch, still haven't recieved it, they said I would receive it on 18 August, it is 18 SEPTEMBER. I will never order something again. I would personally consider them thieves. They haven't even given my money back. They are a perfect example why you can't trust ANYONE. \"We have your back! You never have to worry when you shop on wish.\" The biggest lie I have EVER heard and I have heard HUGE lies in my life.   Full Review"},{"author":"Leif Lang","date":"September 12, 2017","score":"","text":"Good app but DO NOT BE FOOLED BY THE CRAZY MARK DOWNS. I almost baught a watch for $90 marked down from +$1000 but when I looked it up a couple minuts later it turns out I could get it from &$70 with free shipping. With that said I was able to get a refund before the item was processed in only a minute so that's why I gave them 5 stars.   Full Review"},{"author":"Angelina M. Lee","date":"September 15, 2017","score":"","text":"It's expensive on the shipping cost for free merchandises. Although some are fairly at a good price, several are shockingly at a higher cost than expected. To keep Wish more reliable like other organizations, it's recommended to have a trusting connection with the customers and end up creating satisfying results. Another thing that needs to be confirmed is this app should be verified to be safe and keep contents all real. Well, that's what I think for certain products that are recommended or are on the wishlist. Overall, my experience with Wish had slightly increased my interest in it, to a rate of 3 to 5 from 2 to 5 from the beginning. I feel some trustworthiness in the products I just confirmed paying for. :-)   Full Review"},{"author":"","date":"September 13, 2017","score":"","text":"My aunt ordered my sister some $5 stickers about 2 months ago and they still haven't came in. She ordered her some funny lol gravity falls stickers. So this is what happened she ordered them okay but then wish canceled her order but then made her pay a dallor 2 resend the order. But she ordered me STUFF and i got all the stuff that she ordered me. So i guess that wish wanted to keep STANLEY PINES 2 themselves. Well any ways i am happy my stuff came in.   Full Review"},{"author":"eulB staeB","date":"September 14, 2017","score":"","text":"I've bought 4-5 things from this app in the past. All of which have been EXACTLY as they said. Very quality products despite what you may think from the prices. Delivery time is very long, but that's because most of the items come straight from the manufacturer which is typically in Asia. Don't let the wait time hold you back! It's well worth it for the insane deals you're getting! :)   Full Review"}],"ratings":{"nb5":"2,917,700","nb4":"829,480","nb3":"271,372","nb2":"72,811","nb1":"166,298"},"saved_to_db":true}]